In [1]:
import pandas as pd

In [2]:
df_titles = pd.read_csv('titles.csv')

In [3]:
df_titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [4]:
df_cast = pd.read_csv('cast.csv')

In [5]:
df_cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

# How many movies are listed in the titles dataframe?

In [6]:
df_titles.count()

title    244914
year     244914
dtype: int64

# What are the earliest two films listed in the titles dataframe?

In [7]:
df_titles.sort_values('year').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

# How many movies have the title "Hamlet"?

In [8]:
len(df_titles[df_titles['title'] == 'Hamlet'])

20

# How many movies are titled "North by Northwest"?

In [9]:
len(df_titles[df_titles['title'] == 'North by Northwest'])

1

# When was the first movie titled "Hamlet" made?

In [10]:
df_titles[df_titles['title'] == 'Hamlet'].sort_values('year').head(1)

        title  year
52521  Hamlet  1910

# List all of the "Treasure Island" movies from earliest to most recent.

In [11]:
df_titles[df_titles['title'] == 'Treasure Island'].sort_values('year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

# How many movies were made in the year 1950?

In [12]:
df_titles[df_titles['year'] == 1950].shape[0]
# len(df_titles[df_titles['year'] == 1950])

1113

# How many movies were made in the year 1960?

In [13]:
len(df_titles[df_titles['year'] == 1960])

1549

# How many movies were made from 1950 through 1959?

In [14]:
df_titles[(df_titles['year']>1949) & (df_titles['year'] < 1960)]['title'].count()

12934

# In what years has a movie titled "Batman" been released?

In [15]:
df_titles[df_titles['title']=='Batman']

         title  year
39349   Batman  1943
240896  Batman  1989

# ----------------------------------------------------------------

In [16]:
df_cast.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3786176 entries, 0 to 3786175
Data columns (total 6 columns):
 #   Column     Dtype
---  ------     -----
 0   title      object
 1   year       int64
 2   name       object
 3   type       object
 4   character  object
 5   n          float64
dtypes: float64(1), int64(1), object(4)
memory usage: 173.3+ MB

# How many roles were there in the movie "Inception"?

In [17]:
print(df_cast[df_cast['title'] == 'Inception']['character'].count())
len(df_cast[df_cast['title'] == 'Inception']['character'].unique())

78

56

# How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [18]:
df_cast[df_cast['title'] == 'Inception']['n'].isnull().sum()

27

# But how many roles in the movie "Inception" did receive an "n" value?

In [19]:
#df_cast[df_cast['title'] == 'Inception']['n'].notnull().sum()
df_cast[df_cast['title'] == 'Inception']['n'].count()

51

# Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [20]:
df_cast[(df_cast['title'] == 'North by Northwest') & df_cast['n'].notnull()].sort_values('n')[['name','n']]

                         name     n
871426             Cary Grant   1.0
3518333       Eva Marie Saint   2.0
1457165           James Mason   3.0
3157232   Jessie Royce Landis   4.0
356707         Leo G. Carroll   5.0
3048272  Josephine Hutchinson   6.0
1695173           Philip Ober   7.0
1275337         Martin Landau   8.0
2447081         Adam Williams   9.0
1811387          Edward Platt  10.0
665768      Robert Ellenstein  11.0
2295714          Les Tremayne  12.0
464736        Philip Coolidge  13.0
1508344         Patrick McVey  14.0
206471           Edward Binns  15.0
1384780             Ken Lynch  16.0

# Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [21]:
df_cast[(df_cast['title'] == 'Sleuth') & (df_cast['year'] == 1972)].sort_values('n')[['name','n']]

                       name    n
1705394    Laurence Olivier  1.0
326773        Michael Caine  2.0
373876       Alec Cawthorne  3.0
1465483  John (II) Matthews  4.0
2724553  Eve (III) Channing  5.0
1448690        Teddy Martin  6.0

# Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [22]:
df_cast[(df_cast['title'] == 'Sleuth') & (df_cast['year'] == 2007)].sort_values('n')[['name','n']]

                        name    n
326774         Michael Caine  1.0
1293634             Jude Law  2.0
1805907        Harold Pinter  3.0
260242       Kenneth Branagh  NaN
373877   Alec (II) Cawthorne  NaN
2724552    Eve (II) Channing  NaN
3370424    Carmel O'Sullivan  NaN

# How many roles were credited in the silent 1921 version of Hamlet?

In [23]:
len(df_cast[(df_cast['title'] == 'Hamlet') & (df_cast['year'] == 1921)])

9

# How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [24]:
len(df_cast[(df_cast['title']=='Hamlet') & (df_cast['year']==1996)])

54

# How many "Hamlet" roles have been listed in all film credits through history?

In [25]:
len(df_cast[df_cast['title']=='Hamlet'])

342

# How many people have played an "Ophelia"?

In [26]:
len(df_cast[df_cast['character'] == 'Ophelia'])

117

# How many people have played a role called "The Dude"?

In [27]:
len(df_cast[df_cast['character'] == 'The Dude'])

19

# How many people have played a role called "The Stranger"?

In [28]:
len(df_cast[df_cast['character'] == 'The Stranger'])

212

# How many roles has Sidney Poitier played throughout his career?

In [29]:
df_cast[df_cast['name'] == 'Sidney Poitier'].name.count()

43

# How many roles has Judi Dench played?

In [30]:
df_cast[df_cast['name'] == 'Judi Dench'].name.count()

55

# List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [31]:
df_cast[(df_cast['name']=='Cary Grant') & (df_cast['year']>=1940) & (df_cast['n']==2)][['year','character']]

        year    character
871423  1940   Nick Arden
871433  1941  Roger Adams

#  List the leading roles that Cary Grant played in the 1940s in order by year.

In [32]:
df_cast[(df_cast['name']=='Cary Grant') & (df_cast['year']>=1940) & (df_cast['year']<1950) & (df_cast['n']==1)][['year','character']].sort_values('year')

        year                             character
871448  1940                           Matt Howard
871407  1940                          Walter Burns
871450  1940                    C. K. Dexter Haven
871438  1941                      Johnnie Aysgarth
871452  1942                          Leopold Dilg
871429  1942                 Patrick 'Pat' O'Toole
871398  1943                         Capt. Cassidy
871422  1943  Joe Adams -posing as Joe Bascopolous
871430  1944                           Jerry Flynn
871390  1944                     Mortimer Brewster
871425  1944                            Ernie Mott
871424  1946                           Cole Porter
871427  1946                                Devlin
871444  1947                           Dick Nugent
871445  1947                                Dudley
871421  1948                         Jim Blandings
871402  1948                     Dr. Madison Brown
871411  1949                 Captain Henri Rochard

# How many roles were available for actors in the 1950s?

In [33]:
len(df_cast[(df_cast['type'] == 'actor') & (df_cast['year'] >=1950) & (df_cast['year'] <1960)])

157738

# How many roles were available for actresses in the 1950s?

In [34]:
len(df_cast[(df_cast['type'] == 'actress') & (df_cast['year'] >=1950) & (df_cast['year'] <1960)])

57733

# How many leading roles (n=1) were available from the beginning of film history through 1980?

In [35]:
len(df_cast[(df_cast['n']==1)&(df_cast['year']<=1980)])

65140

# How many non-leading roles were available through from the beginning of film history through 1980?

In [36]:
len(df_cast[(df_cast['n']!=1)&(df_cast['year']<=1980)])

1117667

# How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [37]:
len(df_cast[(df_cast.n.isna()) & (df_cast.year <= 1980)])

448347